Repository: Reagent992/async_rutube_downloader
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: The provided URL is invalid. Please check and try again.
ru: Указанный URL-адрес неверен. Пожалуйста, проверьте и повторите попытку.

source: Failed to fetch video data. The URL might be incorrect, or there may be a connection issue.
ru: Не удалось получить данные о видео. URL может быть неправильным, или возникла проблема с соединением.

source: A network issue occurred while downloading a video segment. Please check your internet connection and retry.
ru: Произошла ошибка сети при скачивании сегмента видео. Пожалуйста, проверьте ваше интернет-соединение и попробуйте снова.

source: Download
ru: Загрузить

source: Cancel download
ru: Загрузка отменяется...

source: Rutube Downloader
ru: Загрузчик RuTube

source: Select Folder
ru: Выберите папку

source: No folder selected
ru: Папка не выбрана

source: Enter RuTube URL or Video ID
ru: Введите URL или ID видео на RuTube

source: Get Video Info
ru: Проверить

source: Download Complete
ru: Загрузка завершена

source: Error
ru: Ошибка

source: Please enter a video URL before proceeding.
ru: Пожалуйста, введите URL видео перед продолжением.

source: Info
ru: Информация

source: This CLI utility allows you to download videos from Rutube. - You can download a single video or multiple videos by providing a file with URLs. - By default, videos from a file will be downloaded in the best available quality.
ru: Эта утилита командной строки позволяет загружать видео с Rutube. - Вы можете загрузить одно видео или несколько видео, указав файл с URL. - По умолчанию видео из файла будут загружаться в наилучшем доступном качестве.

source: Usage examples: - Download single video: [{cli_name}] 365ae8f40a2ffd2a5901ace4db799de7 [{cli_name}] https://rutube.ru/video/365ae8f40a2ffd2a5901ace4db799de7/ [{cli_name}] https://rutube.ru/video/365ae8f40a2ffd2a5901ace4db799de7/ -q - Download multiple videos: [{cli_name}] -f ~/path/to/file1.txt [{cli_name}] -f ~/path/to/file2.txt -d ,
ru: Примеры использования: - Загрузить одно видео: [{cli_name}] 365ae8f40a2ffd2a5901ace4db799de7 [{cli_name}] https://rutube.ru/video/365ae8f40a2ffd2a5901ace4db799de7/ [{cli_name}] https://rutube.ru/video/365ae8f40a2ffd2a5901ace4db799de7/ -q - Загрузить несколько видео: [{cli_name}] -f ~/path/to/file1.txt [{cli_name}] -f ~/path/to/file2.txt -d ,

source: Resource not found (404) The URL may be incorrect, or the API might be unavailable.
ru: Ресурс не найден (404) Возможно, указан неверный URL-адрес или API недоступен.

source: Invalid URL
ru: Ошибка недопустимого URL: {}

source: Invalid file. The file contains errors or does not meet validation requirements.
ru: Недопустимый файл. Файл содержит ошибки или не соответствует требованиям.

source: No such file or directory: {}
ru: Каталог загрузки: {}

source: The given path is a directory: {}
ru: Указанный путь является каталогом: {}"

source: Report: Downloaded {} videos, Invalid urls {}, it takes {} minutes, {} seconds
ru: Отчет: Загружено {} видео, Недопустимых URL {}, заняло {} минут, {} секунд

source: Download directory: {}
ru: Каталог загрузки: {}

source: Download cancelled
ru: Загрузка отменена

source: Available qualities:
ru: Доступные качества:

source: Select quality. (Enter the corresponding number)
ru: Выберите качество. (Введите соответствующий номер)

source: [{}] downloaded in {} minutes, {} seconds
ru: [{}] загружено за {} минут, {} секунд

source: [{}] saved to {}
ru: [{}] сохранено в {}

source: [{}] download started
ru: [{}] загрузка начата

source: Invalid URL Error: {}
ru: Ошибка недопустимого URL: {}

source: URL or ID of the Rutube video
ru: URL или ID Rutube видео

source: Output directory (default: current working directory)
ru: Каталог вывода (по умолчанию: текущий каталог)

source: Select video quality interactively
ru: Выберите качество видео в интерактивном режиме

source: Multiple videos download
ru: Загрузить несколько видео

source: Path to the file with URLs
ru: Путь до файла с ссылками

source: Delimiter between URLs in the file(default: \n)
ru: Разделитель между ссылками в файле (по умолчанию: \n)

source: Cancelling download...
ru: Загрузка отменяется...
